# 主要地区经纬度表
# 数据来源：google earth

city = [ '默认', '西安', '曲阜', '太原', '北京', '南京', '洛阳', '安阳', '杭州', '郑州', '开封',
         '大同', '宝鸡', '江陵',
         ]

dlzb = {
	'默认': [35, 120],
	'西安': [34.3428162100, 108.9351709400],
	'曲阜': [35.5810175500, 116.9808365000],
	'太原': [37.8700225000, 112.5443173800],
	'北京': [39.9033261500, 116.4009766800],
	'南京': [32.0604615200, 118.7912916600], # 5
	'洛阳': [34.6191162600, 112.4473231200],
	'安阳': [36.0975527600, 114.3870233300],
	'杭州': [30.2764960400, 120.1504771300],
	'郑州': [34.7484398400, 113.6188881300],
	'开封': [34.7981602200, 114.3014718700], # 10
	'大同': [40.0751589800, 113.2929794200],
	'宝鸡': [34.3633400300, 107.2326010700],
	'江陵': [31.9211549300, 120.2797055900],
	'包头': [40.650000, 109.833333,],
	'沈阳': [41.8, 123.4],
	'青岛': [36.066667, 120.383333],
	'GSM': [35,0]
}

def GetGeoCoord(ui):
	site = ui.cblSEarea.currentText()
	if site in ['填写坐标', '全球']:
		try:
			return '指定', eval(ui.txtGeoLong.text()), eval(ui.txtGeoLong.text())
		except:
			ui.edit.append('请在地区栏输入经纬度\n\n')
	else:
		ui.txtGeoLong.setText(str(round(dlzb[site][1], 3)))
		ui.txtGeoLat.setText(str(round(dlzb[site][0], 3)))
		return site, dlzb[site][1], dlzb[site][0]