# 参考资料：方诗铭《中国历史纪年表（修订本）》，2007年
# 基本结构，一个列表记录朝代名、起始年、终止年、君王表、年号表、年号施用年数表
# 起始年仅表示该朝代第一个年号的起始年，非该朝代是起始年
# 一般情况，中国古代君王在继位后的当年会使用前王所用年号，第二年才改元。
# 对于特殊情况，对年数表的第二维数据的首个元素用不同的数值进行标记，这个数值用字符串表示以保证程序可读性。
# 1. 大于0的数表示同年改元且年数从该数值开始排列。
#       其中等于1即表示新年号从元年开始计数。
# 2. 0表示继任君王没有改元，而是继续使用前王的年号。实质如3中指定为前王已用年数。
# 3. 小于0的数取其绝对值表示同年改元但年数不从元年而从该数值+1开始排列。

######################### 朝代数据 #########################
Zhou = ['周', -841, -256,
        ["共和", "宣王", "幽王", "平王", "桓王", "庄王", "僖王", "惠王", "襄王", "顷王", "匡王", "定王", "简王", "灵王", "景王", "敬王", "元王", "贞定王", "考王", "威烈王", "安王", "烈王", "显王", "慎靓王", "赧王"],
        [['']] * 25,
        [[14], [46], [11], [51], [23], [15], [5], [25], [33], [6], [6], [21], [14], [27], [25], [43], [8], [28], [15], [24], [26], [7], [48], [6], [59]]
        ]
Lu = ['鲁', -855, -256,
        ["真公","武公","懿公","孝公","惠公","隐公","桓公","庄公","闵公","僖公","文公","宣公","成公","襄公","昭公","定公","哀公"],
        [['']] * 17,
        [[30], [10], [9], [38], [46], [11], [18], [32], [2], [33], [18], [18], [18], [31], [32], [15], [18]]
      ]
Qin = ['秦', -306, -206,
        ["昭王", "孝文王", "庄襄王", "王政", "始皇", "二世", "子婴"],
        [['']] * 7,
        [[56], [1], [3], [26], ['26',37], [3], [1]]
       ]
Han = ['汉', -206, 8,
        ["高祖","惠帝","高后","文帝","景帝","武帝","昭帝","宣帝","元帝","成帝","哀帝","平帝","孺子婴"],
        [[''],[''],[''],['','后元'],['','中元','后元'],['建元','元光','元朔','元狩','元鼎','元封','太初','天汉','太始','征和','后元'],['始元','元凤','元平'],['本始','地节','元康','神爵','五凤','甘露','黄龙'],['初元','永光','建昭','竟宁'],['建始','河平','阳朔','鸿嘉','永始','元延','绥和'],['建平','太初元将','建平','元寿'],['元始'],['居摄','初始']],
        [[12], [7], [8], [16,7], [7,6,3], [6,6,6,6,6,6,4,4,4,4,2], [6,6,1], [4,4,4,4,4,4,1], [5,5,5,1], [4,4,4,4,4,4,2], [2,'1',1,'2',4,2], [5], [3,'1',1]]
       ]
Xin = ['新', 9, 24,
        ["王莽"],
        [['始建国','天凤','地皇']],
        [[5, 6, 4]]
       ]
XuanHan = ['更始', 23, 25,
            ["淮阳王"],
            [["更始"]],
            [[3]]
           ]
DongHan = ['东汉', 25, 220,
            ["光武帝","明帝","章帝","和帝","殇帝","安帝","少帝","顺帝","冲帝","质帝","桓帝","灵帝","少帝","献帝"],
            [["建武","建武中元"],["永平"],["建初","元和","章和"],["永元","元兴"],["延平"],["永初","元初","永宁","建光","延光"],["延光"],["永建","阳嘉","永和","汉安","建康"],["永憙"],["本初"],["建和","和平","元嘉","永兴","永寿","延熹","永康"],["建宁","熹平","光和","中平"],['光熹','昭宁'],['永汉',"中平","初平","兴平","建安","延康"]],
            [[32,'1',2], [18], [9,'1',4,'1',2], [17,'1',1], [1], [7,7,'1',2,'1',2,'1',4], ['4',4], [7,'1',4,6,3,'1',1], [1], [1], [3,1,3,'1',2,4,'1',10,'1',1], [5,'1',7,'1',7,'1',6], ['1',1,'1',1], ['1',1,'6',6,4,2,25,'1',1]]
           ]
Wei = ['魏', 220, 265,
        ["文帝", "明帝", "齐王", "高贵乡公", "元帝"],
        [["黄初"], ["太和","青龙","景初"], ["正始","嘉平"], ["正元","甘露"], ["景元","咸熙"]],
        [[7], [7,'1',5,'1',3], [9,6], ['1',3,'1',5], ['1',5,'1',2]]
       ]
Shu = ['蜀汉', 221, 264,
        ['昭烈帝', '后主'],
        [['章武'], ['建兴', '延熙', '景耀', '炎兴']],
        [[3], ['1',15,20,6,'1',1]]
       ]
Wu = ['吴', 222, 280,
        ['大帝', '会稽王', '景帝', '末帝'],
        [['黄武', '黄龙', '嘉禾', '赤乌', '太元', '神凤'], ['建兴', '五凤', '太平'], ['永安'], ['元兴', '甘露', '宝鼎', '建衡', '凤凰', '天册', '天玺', '天纪']],
        [[8,'1',3,7,'1',14,'1',2,'1',1], ['1',2,3,'1',3], ['1',7], ['1',2,'1',2,'1',4,'1',3,3,2,'1',1,4]]
      ]
XiJin = ['晋', 265, 317,
        ["武帝","惠帝","怀帝","愍帝"],
        [["泰始","咸宁","太康","太熙"],["永熙","永平","元康","永康","永宁","太安","永安","建武","永安","永兴","光熙"],["永嘉"],["建兴"]],
        [[10,6,'1',10,1], ['1',1,1,'1',9,2,'1',2,'1',2,1,'1',1,'1',1,'1',3,'1',1], [7], ['1',5]]
         ]
DongJin = ['东晋', 317, 420,
            ['元帝','明帝','成帝',"康帝","穆帝","哀帝","废帝","简文帝","孝武帝","安帝","恭帝"],
            [['建武','太兴','永昌'],['太宁'],['咸和','咸康'],['建元'],['永和','升平'],['隆和','兴宁'],['太和'],['咸安'],['宁康','太元'],['隆安','大亨','元兴','义熙'],['元熙']],
            [[2,'1',4,2], ['1',4], ['1',9,8], [2], [12,5], [1,3], [6], ['1',2], [3,21], [6,'1',1,'1',3,14], [2]]
           ]
BeiWei = ['北魏', 386, 534,
            ['道武帝', '明元帝', '太武帝', '南安王','文成帝', '献文帝', '孝文帝', '宣武帝', '孝明帝', '孝庄帝', '长广王', '节闵帝', '安定王', '孝武帝'],
            [['登国','皇始','天兴','天赐'],['永兴','神瑞','泰常'],['始光','神䴥','延和','太延','太平真君','正平'],['承平'],['兴安','兴光','太安','和平'],['天安','皇兴'],['延兴','承明','太和'],['景明','正始','永平','延昌'],['熙平','神龟','正光','孝昌','武泰'],['建义','永安'],['建明'],['普泰'],['中兴'],['太昌','永兴','永熙']],
            [[11,'1',3,'1',7,'1',6], ['1',5,3,'1',8], [5,'1',4,3,6,'1',12,'1',2], ['1',1], ['1',3,'1',2,'1',5,6], [2,'1',5], ['1',6,'1',1,23], [4,5,'1',5,'1',4], [3,'1',3,'1',6,'1',3,1], ['1',1,'1',3], ['1',1], [1], ['1',2], ['1',1,'1',1,'1',3]]
          ]
DongWei = ['东魏', 534, 550,
            ['孝静帝'],
            [['天平', '元象', '兴和', '武定']],
            [[4,2,'1',4,8]]
           ]
XiWei = ['西魏', 535, 556,
        ['文帝', '废帝', '恭帝'],
        [['大统'], [''], ['']],
        [[17], [2], [3]]
        ]
BeiQi = ['北齐', 550, 577,
            ['文宣帝', '废帝', '孝昭帝', '武成帝', '后主', '幼主'],
            [['天保'],['乾明'], ['皇建'], ['太宁','河清'], ['天统','武平','隆化'],['承光']],
            [[10], [1], ['1',2], ['1',2,'1',4], ['1',5,7,'1',1], [1]],
         ]
BeiZhou = ['北周', 556, 581,
            ['孝闵帝', '明帝', '武帝', '宣帝', '静帝'],
            [[''], ['','武成'], ['保定','天和','建德','宣政'], ['大成'], ['大象','大定']],
            [[2], ['1',3,'1',2], [5,7,'1',7,'1',1], [1], ['1',2,1]]
           ]
NC_Song = ['宋', 420, 479,
            ['武帝', '少帝', '文帝', '孝武帝', '前废帝', '明帝', '后废帝', '顺帝'],
            [['永初'],['景平'],['元嘉'],['孝建','大明'],['永光','景和'],['泰始','泰豫'],['元徽'],['昇明']],
            [[3], [2], ['1',30], [3,8], [1,'1',1], ['1',7,1], [5], ['1',3]]
           ]
NC_Qi = ['南齐', 479, 502,
        ['高帝', '武帝', '鬱林王', '海陵王', '明帝', '东昏侯', '和帝'],
        [['建元'], ['永明'], ['隆昌'], ['延兴'], ['建武','永泰'],['永元'],['中兴']],
        [[4], [11], [1], ['1',1], ['1',5,'1',1], [3], ['1',2]]
         ]
NC_Liang = ['梁', 502, 557,
            ['武帝', '简文帝', '豫章王', '元帝', '贞阳侯', '敬帝'],
            [['天监','普通','大通','中大通','大同','中大同','太清'],['大宝'],['天正'],['承圣'],['天成'],['绍泰','太平']],
            [[18,8,'1',3,'1',6,12,'1',2,'1',3], [2], ['1',2], ['1',4], ['1',1], ['1',2,'1',2]]
            ]
NC_Chen = ['陈', 557, 589,
            ['武帝', '文帝', '废帝', '宣帝', '后主'],
            [['永定'],['天嘉','天康'],['光大'],['太建'],['至德','祯明']],
            [[3], [7,'1',1], [2], [14], [4,3]]
           ]
Sui = ['隋', 581, 618,
        ['文帝', '炀帝', '恭帝', '越王'],
        [['开皇','仁寿'], ['大业'], ['义宁','大业'], ['皇泰']],
        [[20,4], [13], ['1',2,'-13',14], ['1',1]]
       ]
Tang = ['唐', 618, 907,
        ['高祖', '太宗', '高宗', '中宗', '睿宗', '武后', '（武周）', '中宗', '少帝', '睿宗', '玄宗', '肃宗','代宗','德宗','顺宗','宪宗','穆宗','敬宗','文宗','武宗','宣宗','懿宗','僖宗','昭宗','哀帝'],
        [['武德'],['贞观'],['永徽','显庆','龙朔','麟德','乾封','总章','咸亨','上元','仪凤','调露','永隆','开耀','永淳','弘道'],['嗣圣'],['文明'],['光宅','垂拱','永昌','载初'],['天授', '如意','长寿', '延载', '证圣','天册万岁', '万岁登封','万岁通天', '神功', '圣历', '久视', '大足','长安','神龙'],['神龙','景龙'],['唐隆'],['景云','太极','延和'],['先天','开元','天宝'],['至德','乾元','上元','','宝应'],['广德','永泰','大历'],['建中','兴元','贞元'],['永贞'],['元和'],['长庆'],['宝历'],['太和','开成'],['会昌'],['大中'],['咸通'],['乾符','广明','中和','光启','文德'],['龙纪','大顺','景福','乾宁','光化','天复','天祐'],['天祐']],
        [[9],[23],[6,6,'1',3,2,3,'1',3,'1',5,'1',3,'1',4,'1',2,'1',2,'1',2,'1',2,'1',1],[1],['1',1],['1',1,4,1,1], ['1',3,'1',1,'1',3,'1',2,'1',1,'1',2,'1',1,'1',2,'1',2,'1',3,'1',2,'1',1,'1',5,'1',1],['1',3,'1',4],['1',1],
         ['1',2,1,'1',1],['1',2,'1',29,15],['1',3,'1',3,'1',2,1,'1',2],['1',2,2,'1',14],[4,1,21],['1',1],[15],[4],[3],['1',9,5],[6],[14],['1',15],['1',6,2,'1',5,'1',4,'1',1],[1,2,2,5,'1',4,'1',4,'1',1],['1',4]]
        ]
HouLiang = ['后梁', 907, 923,
            ['太祖', '朱友珪', '末帝'],
            [['开平', '乾化'], ['凤历'], ['乾化', '贞明', '龙德']],
            [[5, '1', 2], [1], ['3', 5, '1', 7, '1', 3]]
            ]
HouTang = ['后唐', 923, 936,
            ['庄宗', '明宗', '闵帝', '末帝'],
            [['同光'], ['天成', '长兴'], ['应顺'], ['清泰']],
            [[4], ['1', 5, '1', 4], [1], ['1', 3]]
           ]
HouJin = ['后晋', 936, 947,
            ['高祖', '出帝'],
            [['天福'], ['天福','开运']],
            [[7], ['7', 9, '1', 4]]
          ]
HouHan = ['后汉', 936, 950,
            ['高祖', '隐帝'],
            [['天福', '乾祐'], ['乾祐']],
            [[12, 1], ['1',3]]
          ]
HouZhou = ['后周', 951, 960,
            ['太祖', '世宗', '恭帝'],
            [['广顺','显德'], ['显德'], ['显德']],
            [[3, 1], ['1', 6], ['6', 6]]
           ]
BeiSong = ['北宋', 960, 1126,
            ['太祖', '太宗', '真宗', '仁宗', '英宗', '神宗', '哲宗', '徽宗', '钦宗'],
            [['建隆','乾德','开宝'],['太平兴国','雍熙','端拱','淳化','至道'],['咸平','景德','大中祥符','天禧','乾兴'],['天圣','明道','景祐','宝元','康定','庆历','皇祐','至和','嘉祐'],['治平'],['熙宁','元丰'],['元祐','绍圣','元符'],['建中靖国','崇宁','大观','政和','重和','宣和'],['靖康']],
            [[3,5,8], [8,4,2,5,3], [6,4,9,5,1], [9,2,4,2,1,8,5,2,8], [4], [10,8], [8,4,3], [1,5,4,7,1,7], [1]]
           ]
NanSong = ['南宋', 1127, 1279,
            ['高宗', '孝宗', '光宗', '宁宗', '理宗', '度宗', '恭帝', '端宗', '赵昺'],
            [['建炎','绍兴'],['隆兴','乾道','淳熙'],['绍熙'],['庆元','嘉泰','开禧','嘉定'],['宝庆','绍定','端平','嘉熙','淳祐','宝祐','开庆','景定'], ['咸淳'],['德祐'],['景炎'],['祥兴']],
            [[4, 32], [2,9,16], [5], [6,4,3,17], [3,6,3,4,12,6,1,5], [10], [1] ,[2] ,[2]]
           ]
Liao = ['辽', 907, 1125,
        ['太祖', '太宗', '世宗', '穆宗', '景宗', '圣宗', '兴宗', '道宗', '天祚帝'],
        [['', '神册', '天赞', '天显'],['天显','会同','大同'],['天禄'],['应历'],['保宁','乾亨'],['统和','开泰','太平'],['景福','重熙'],['清宁','咸雍','太康','大安','寿昌'],['乾统','天庆','保大']],
        [[9, 6, 4, 2],['0',12,9,1], ['1',4], [18], [10,4], [29,9,10], [1,23], [10,10,10,10,6], [10,10,5]]
        ]
BeiLiao = ['北辽',1122, 1123,
            ['宣宗', '萧德妃', '梁王'],
            [['建福'], ['德兴'], ['神历']],
            [[1], ['1',1], [1]]
           ]
XiLiao = ['西辽', 1124, 1211,
            ['德宗', '感天后', '仁宗', '承天后', '末主'],
            [['延庆','康国'], ['咸清'], ['绍兴'], ['崇福'], ['天禧']],
            [[10,10], [7], [13], [14], [34]]
          ]
XiXia = ['西夏', 1032, 1227,
        ['景宗', '景宗', '毅宗', '惠宗', '崇宗', '仁宗', '桓宗', '襄宗', '神宗', '献宗', '末主'],
        [['明道','开运'],['广运','大庆','天授礼法延祚'],['延嗣宁国','天祐垂圣','福盛承道','奲都','拱化'],['乾道','天赐礼盛国庆','大安','天安礼定'],['天仪治平','天祐民安','永安','贞观','雍宁','元德','正德','大德'],['大庆','人庆','天盛','乾祐'],['天庆'],['应天','皇建'],['光定'],['乾定'],['宝义']],
        [[2,1], ['1',2,2,11], [1,3,4,6,5], [1,5,11,2], [3,8,3,13,5,8,8,5], [4,5,21,24], [12], [4,1], [13], [3], [1]]
         ]
Jin = ['金', 1115, 1234,
        ['太祖', '太宗', '熙宗', '海陵王', '世宗', '章宗', '卫绍王', '宣宗', '哀宗', '末帝'],
        [['收国','天辅'], ['天会'],['天会','天眷','皇统'], ['天德','贞元','正隆'], ['大定'], ['明昌','承安','泰和'],['大安','崇庆','至宁'],['贞祐','兴定','元光'],['正大','开兴','天兴'],['天兴']],
        [[2,6], [12],['0',15,3,8], [4,3,5], [29], [6,5,8], [3,1,1], ['1',4,5,2],[8,1,'1',2],['0',3]]
       ]
MengGu = ['蒙古', 1206, 1270,
            ['太祖铁木真', '拖雷', '太宗窝阔台', '乃马真后', '定宗', '海迷失后', '宪宗蒙哥', '世祖忽必烈'],
            [[''],[''],[''],[''],[''],[''],[''],['中统','至元']],
            [[22], [1], [13], [4], [3], [2], [9], [4, 7]]
          ]
Yuan = ['元', 1264, 1368,
        ['世祖', '成宗', '武宗', '仁宗', '英宗', '泰定帝', '天顺帝', '文宗', '明宗', '文宗', '宁宗', '惠宗'],
        [['至元'], ['元贞','大德'], ['至大'], ['黄庆','延祐'], ['至治'], ['泰定','致和'], ['天顺'], ['天历'], ['天历'], ['天历','至顺'], ['至顺'], ['元统','至元','至正']],
        [[31], [2,11], [4], [2,7], [3], [4,1], ['1',1], ['1',1], ['0',2], ['2',2,2], ['0',3], [2,6,30]]
        ]
BeiYuan = ['北元', 1371, 1388,
        ['昭宗', '脱古思帖木儿'],
        [['宣光'], ['天元']],
        [[8], [10]]
         ]
Ming = ['明', 1368, 1644,
        ['太祖', '惠帝', '成祖', '仁宗', '宣宗', '英宗', '代宗', '英宗', '宪宗', '孝宗', '武宗', '世宗', '穆宗', '神宗', '光宗', '熹宗', '思宗'],
        [['洪武'],['建文'],['永乐'],['洪熙'],['宣德'],['正统'],['景泰'],['天顺'],['成化'],['弘治'],['正德'],['嘉靖'],['隆庆'],['万历'],['泰昌'],['天启'],['崇祯']],
        [[31], [4], [22], [1], [10], [14], [7], [8], [23], [18], [16], [45], [6], [47], [1], [7], [17]]
        ]
Hou_Jin = ['后金', 1616, 1635,
            ['太祖努尔哈赤', '太宗皇太极'],
            [['天命'], ['天聪']],
            [[11], [9]]
           ]
Qing = ['清', 1636, 1911,
        ['太宗', '世祖', '圣祖', '世宗', '高宗', '仁宗', '宣宗', '文宗', '穆宗', '德宗', '溥仪'],
        [['崇德'], ['顺治'], ['康熙'], ['雍正'], ['乾隆'], ['嘉庆'], ['道光'], ['咸丰'], ['同治'], ['光绪'], ['宣统']],
        [[8], [18], [61], [13], [60], [25], [30], [11], [13], [34], [3]]
        ]

dynasties = [  # 朝代表
        Zhou, Lu, Qin, Han, Xin, XuanHan, DongHan, Wei, Shu, Wu, XiJin, DongJin, NC_Song, NC_Qi, NC_Liang, NC_Chen,
        BeiWei, DongWei, XiWei, BeiQi, BeiZhou, Sui, Tang, HouLiang, HouTang, HouJin, HouHan, HouZhou, BeiSong,
        NanSong, Liao, BeiLiao, XiLiao, XiXia, Jin,  MengGu, Yuan, Ming, BeiYuan, Hou_Jin, Qing]


######################### 生成纪年表 #########################
from Data.OtherData import *

def sz2hz(x): # 数字转为汉字
    if x == 0: # 1
        return '元'
    elif x < 10: # 2-9
        return hzjs[x]
    elif 9 < x < 19: # 10-19
        return hzjs[9] + hzjs[int(str(x)[1])]
    elif (x + 1) % 10 == 0: # 20以上的整十
        return hzjs[int(str(x)[0])] + hzjs[int(str(x)[1])]
    else:
        return hzjs[int(str(x)[0])-1] + hzjs[9] + hzjs[int(str(x)[1])]

def cdnh(gh, ce, name, nianhao, year, x):
    for i in range(len(name)): # 某朝代的王公序
        idx = 0  # 年号年数索引
        for j in range(len(nianhao[i])): # 某王公的年号序
            y = 0 # 改元始年（该年号已用年数）
            if len(nianhao[i]) != len(year[i]):
                if isinstance(year[i][j+idx], str): # 使用前王年号
                    idx += 1
                    if int(year[i][j+idx-1]) == 0:  # 继用年号，已用年数从前王末年中取
                        y = int(year[i-1][-1])
                    elif int(year[i][j+idx-1]) < 0:  # 同年改元且指定已用年数
                        y = -int(year[i][j+idx-1])
                        ce -= 1
                    else:  # 同年改元
                        y = int(year[i][j+idx-1]) - 1  # 该年号起始年
                        ce -= 1
                    if j == 0: # 字符串标记：0为同年改元，-1为沿用前王年号，其余为改元且指定年号已用年数
                        duration = year[i][1:]
                    if j > 0:
                        if idx == 1:  # 仅第一次
                            duration = year[i][0:j] + year[i][j+1:]
                        else:
                            duration = duration[0:j] + duration[j + 1:]
                elif j == 0: duration = year[i]  # 首年号正常改元
            else: duration = year[i]
            for k in range(duration[j]-y): # 年号年数
                if (i == 0 and k >= x) or (i == 0 and j != 0) or i > 0:  # 非首年（若王朝元年不从某王元年开始则跳过）
                    if eranames[ce + 841] == '': # 接续
                        eranames[ce + 841] = dynasties[gh][0] + name[i] + nianhao[i][j] + sz2hz(k+y) + '年'
                        eratable[ce + 841] = [[dynasties[gh][0], name[i], nianhao[i][j], k + y, [gh, i]]]
                    else: # 政权替代或并立
                        eranames[ce + 841] += '、' + dynasties[gh][0] + name[i] + nianhao[i][j] + sz2hz(k+y) + '年'
                        eratable[ce + 841].append([dynasties[gh][0], name[i], nianhao[i][j], k + y, [gh, i]])
                ce += 1
                if ce == 0: ce += 1
    return eranames


eranames = [''] * (841+1+1911) # 公元前 + 公元后
eratable = [''] * (841+1+1911)
snb = [0, 14, 51] # 朝代接续首年表（纪元不从起始年开始的朝代）
for d in range(len(dynasties)):
    dynasty = dynasties[d]
    if dynasty == Yuan:
        snb.append(7)
    elif dynasty == HouHan:
        snb.append(11)
    elif dynasty not in [Zhou, Lu, Qin]:
        snb.append(0)
    cdnh(d, dynasty[1], dynasty[3], dynasty[4], dynasty[5], snb[dynasties.index(dynasty)])

single_eranames = []
year_eranames = []
for i in range(len(eranames)):
    s = eranames[i].split('、')
    for j in range(len(s)):
        year_eranames.append(-841 + i)
        single_eranames.append((s[j]))
