# 恒星表，数据来源：依巴谷星表
# 参数：中文名，英文名，赤经，赤纬，视差，自行（赤经），自行（赤纬）
from AstroCalc.StarCalc import *

# 二十八宿
jiao = Star('角', 'α Vir', '13h 25m 11.5793s',"-11d 9' 11.5793" , 13.06, -42.35, -30.67) # Spica
kang = Star('亢', 'κ Vir', '14h 12m 53.74109s', "-10d 16' 26.5579", 12.80, 7.25, 139.88)
di = Star('氐', 'α Lib', '14h 50m 52.77724s', "-16d 2' 29.7970", 43.03, -105.68, -68.4) # Zubenelgenubi
fang = Star('房', 'π Sco', '15h 58m 51.12066s', "-26d 6' 50.5538", 5.57, -11.42, -26.83)
xin = Star('心', 'σ Sco', '16h 21m 11.32257s', "-25d 35' 33.9090", 4.68, -10.6, -16.28) # 一为α Sco
wei1 = Star('尾', 'μ¹ Sco', '16h 51m 52.23895s',"-38d 2' 50.3764" , 6.51, -10.58, -22.06)
ji = Star('箕', 'γ Sgr', '18h 5m 48.52457s', "-30d 25' 25.1406", 33.67, -53.92, -180.9)
dou = Star('斗', 'φ Sgr', '18h 45m 39.35297s', "-26d 59' 26.8051", 13.63, 50.61, 1.22)
niu = Star('牛', 'β Cap', '20h 21m 0.64616s', "-14d 46' 53.0436", 9.98, 44.92, 7.38)
nv = Star('女', 'ε Aqr', '20h 47m 40.53251s', "-9d 29' 44.4835", 15.7, 33.98, -34.77)
xu = Star('虚', 'β Aqr', '21h 31m 33.52071s', "-5d 34' 16.1602", 6.07, 18.77, -8.21)
wei2 = Star('危', 'α Aqr', '22h 5m 47.03593s', "-0d 19' 11.4568", 6.23, 18.25, -9.39) # Sadalmelik
shi = Star('室', 'α Peg', '23h 4m 45.61693s', "15d 12' 19.3231", 24.46, 61.1, -42.56) # Markab
bi = Star('壁', 'γ Peg', '0h 13m 14.15003s', "15d 11' 1.0180", 8.33,  1.98,  -9.28) # Algenib
kui_2 = Star('奎', 'ζ And', '0h 47m 20.39021s', "24d 16' 2.5563", 71.24, -101.17, -81.77)
kui_1 = Star('奎宿一', 'η And', '0h 57m 12.42782s', "23d 25' 3.9358", 14.20, -43.72, -46.06) # 宋以后改
lou = Star('娄', 'β Ari', '1h 54m 38.34937s', "20d 48' 29.8794", 55.60,  98.74, -110.41)
wei3  = Star('胃', '35 Ari', '2h 43m 27.11185s', "27d 42' 25.7233", 9.51, 2.06,-10.37)
mao = Star('昴', '17 Tau', '3h 44m 52.52356s', "24d 6' 48.4142", 8.06, 21.55, -44.92) # Electra
bi3  = Star('毕', 'ε Tau', '4h 28m 36.93323s', "19d 10' 49.8757", 22.24, 106.19, -37.84)
zi_2 = Star('觜', 'φ1 Ori', '5h 34m 49.23788s', "9d 29' 22.5076", 3.00, 0.27,  -2.26)
zi_1 = Star('觜宿一', 'λ1 Ori', '5h 35m 8.27781s', "9d 56' 2.9869", 2.97,  -0.34,  -2.94) # 宋以后改
shen_3 = Star('参', 'δ Ori', '5h 32m 0.39972s', "	-0d 17' 56.7364", 4.71, 0.64, -0.69) # 一为ζ Ori # Mintaka
shen_1 = Star('参宿一', 'ζ Ori', '6h 11m 56.39676s', "14d 12' 31.7316", 5.37, 0.29, -20.12)# 宋以后改
jing = Star('井', 'μ Gem', '6h 22m 57.59125s', "22d 30' 49.8606", 14.08, 56.39, -110.03)
gui = Star('鬼', 'θ Cnc', '8h 31m 35.72962s', "18d 5' 39.9160", 7.86, -60.85, -56.14)
liu = Star('柳', 'δ Hya', '8h 37m 39.40742s', "5d 42' 13.6749", 20.34, -70.19, -7.9)
xing = Star('星', 'α Hya', '9h 27m 35.25169s', "-8d 39' 31.2591", 18.09, -15.23, 34.37) # Alphard
zhang = Star('张', 'υ¹ Hya', '9h 51m 28.68244s', "-14d 50' 47.5798", 12.36,  18.88, -21.85)
yi = Star('翼', 'α Cra', '10h 59m 46.74887s', "-18d 17' 56.7503", 20.49, -462.26, 129.49)
zhen = Star('轸', 'γ Crv', '12h 15m 48.46784s', "-17d 32' 31.1409", 21.23,  -158.61, 21.86) # Gienah
persei = Star('', 'θ Persei', '2h 44m 11.986s', "49d 13' 42.48", 89.87, 334.66, -89.5) # 程序测试星
And = Star('', 'α And', '0h 8m 23.16812s', "29d 5' 26.9821", 33.62, 137.46, -163.44) # 程序测试星

# 其他
Antares = Star('大火','α Sco', '16h 29m 24.46759s',"-26d 25' 55.0055",5.89,-12.11,-23.3)
hu = Star('弧', 'κ CMa', '6h 49m 50.46544s', "-32d 30' 30.5551", 4.95, -8.84, 3.73)
jian = Star('建', 'ξ2 Sgr', '18h 57m 43.77925s', "-21d 6' 23.8446", 8.93, 31.72, -13.33)
fa = Star('伐', '42 Ori', '5h 35m 23.16427s', "-4d 50' 18.0881", 3.69, 4.52, -7.11)
bi_5 = Star('毕宿五', 'α Tau', '4h 35m 55.20047s', "16d 30' 35.1417", 48.94, 63.45, -188.94)
xy_14 = Star('轩辕十四', 'α Leo', '10h 8m 22.45930s', "11d 58' 1.9027", 41.13, -248.73, 5.59)
bh_3 = Star('北河三', 'β Gem', '7h 45m 19.36391s', "28d 1' 34.7168", 96.54, -626.55, -45.8)
Eltanin = Star('右枢', 'β UMi', '17h 56m 36.37783s', "51d 29' 20.2236", 21.14, -8.48, -22.79)
Kochab = Star('北极二', 'β UMi', '14h 50m 42.39547s', "74d 9' 19.7142", 24.91, -32.61, 11.42)
Polaris = Star('勾陈一', 'α UMi', '2h 31m 47.07432s', "89d 15' 50.8960", 7.54, 44.48, -11.85)
Scorpii_G = Star('傅说', 'G Scorpii', '17h 49m 51.48081s', "-37d 2' 35.8975", 25.92, 40.59, 27.24)

# 星表
esbx =  [jiao,kang,di,fang,xin,wei1,ji, dou,niu,nv,xu,wei2,shi,bi, kui_2,lou,wei3,mao,bi3,zi_2,shen_3, jing,gui,liu,xing,zhang,yi,zhen] # 二十八宿
esbx2 = [jiao,kang,di,fang,xin,wei1,ji, dou,niu,nv,xu,wei2,shi,bi, kui_1,lou,wei3,mao,bi3,zi_1,shen_1, jing,gui,liu,xing,zhang,yi,zhen] # 宋以后二十八宿
esbxzb = {}
for i in range(len(esbx)):
	esbxzb.update({esbx[i].name: esbx[i]})
szzx = [xing, Antares, xu, mao] # 四仲中星
hxb = [Antares, hu, jian, fa, kui_1, zi_1, shen_1, bi_5, xy_14, bh_3, Eltanin, Kochab, Polaris, Scorpii_G]
hxb_name = []
hxzb ={}
for i in range(len(hxb)):
	hxb_name.append(hxb[i].name + ' ' + hxb[i].design)  # 列表更新
	hxzb.update({hxb[i].name: hxb[i]})                  # 字典更新



